---
kind: method
id: M:Autodesk.Revit.DB.Architecture.Stairs.GetStairsSupports
zh: 楼梯
source: html/25cddd3f-315f-7648-b87d-a12107613cde.htm
---
# Autodesk.Revit.DB.Architecture.Stairs.GetStairsSupports Method

**中文**: 楼梯

Returns all the stairs support components in the stairs.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetStairsSupports()
```